# NEW Update Buyer/Supplier

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from scipy import stats
import statsmodels.api as sm
import seaborn as sns
import datetime

In [2]:
buy_sell=pd.read_csv('buyer_seller.csv')

In [3]:
rebuy=pd.read_csv('retailer_buyer_list.csv')

In [4]:
buy_sell.head()

,QuoteID or Invoice ID,buyer_id,seller_id,Auction Flag,quote_created_at,item_id,total,cost,status,buyer,seller,Net Revenue,Company Name,wk,month,year
0,LPE-204253-1902,204253,162784,Offline,2019-12-03,17149,1327.00,1154.49,Complete,Clotheshorse Anonymous TX,Marque Supply,172.51,Clotheshorse Anonymous TX,201949,201912,2019
1,LPE-204253-1902,204253,162784,Offline,2019-12-03,17609,537.00,467.19,Complete,Clotheshorse Anonymous TX,Marque Supply,69.81,Clotheshorse Anonymous TX,201949,201912,2019
2,LPE-204253-1902,204253,162784,Offline,2019-12-03,17486,937.00,815.19,Complete,Clotheshorse Anonymous TX,Marque Supply,121.81,Clotheshorse Anonymous TX,201949,201912,2019
3,LPE-204253-1902,204253,162784,Offline,2019-12-03,17413,667.00,580.29,Complete,Clotheshorse Anonymous TX,Marque Supply,86.71,Clotheshorse Anonymous TX,201949,201912,2019
4,LPE-92048-1901,92048,162784,Offline,2019-12-03,17464,667.00,580.29,Complete,Designer Revival,Marque Supply,86.71,Designer Revival,201949,201912,2019

In [5]:
buy_sell['quote_created_at']=pd.to_datetime(buy_sell['quote_created_at'],  errors='coerce', format='%Y-%m-%d')
buy_sell['total']=pd.to_numeric(buy_sell['total'], errors='coerce')
buy_sell['cost']=pd.to_numeric(buy_sell['cost'], errors='coerce')

## April

In [6]:
april=buy_sell.loc[(buy_sell['month']=='202104')]

In [7]:
april_new=april.groupby('buyer_id')['total'].sum().reset_index()

In [8]:
april_new['buyer_id']=pd.to_numeric(april_new['buyer_id'])

In [9]:
rebuy=rebuy[['User ID', 'Retailer Name']]

In [10]:
rebuy.shape

(343, 2)

In [11]:
apr_update=rebuy.merge(april_new, left_on='User ID', right_on='buyer_id', how='outer')

apr_update.head()

    User ID     Retailer Name  buyer_id    total
0  186104.0          sydney.s  186104.0   5466.0
1  182715.0             WGACA  182715.0    720.0
2  205200.0      jonathanriss       NaN      NaN
3    2829.0         Chic Girl    2829.0  10507.0
4  188669.0  Bag Borrow Steal  188669.0  43711.0

In [12]:
apr_update['total']=apr_update['total'].fillna(0)
apr_update.head()
# apr_update.to_excel('april_gmv.xlsx')

    User ID     Retailer Name  buyer_id    total
0  186104.0          sydney.s  186104.0   5466.0
1  182715.0             WGACA  182715.0    720.0
2  205200.0      jonathanriss       NaN      0.0
3    2829.0         Chic Girl    2829.0  10507.0
4  188669.0  Bag Borrow Steal  188669.0  43711.0

In [13]:
apr_update['total'].sum()

1854808.0

In [14]:
apr_sell=april.groupby('seller')['total'].sum().reset_index()
apr_items=april.groupby('seller')['item_id'].count().rename('item_count').sort_values(ascending=False).reset_index()

apr_seller=apr_sell.merge(apr_items)

apr_seller.head()

                     seller    total  item_count
0               BrandJFA_WS  63062.0          44
1                  BrandOff  85872.0         126
2  Camille+brandstreetTokyo  21297.0          45
3  DallasDesigner_wholesale   1255.0           1
4                  Icone_WS   1843.0           4

In [15]:
apr_seller['total'].sum()

1854808.0

In [16]:
supply=pd.read_csv('suppliers.csv')

In [17]:
new_apr_sup=supply[['Seller ID', 'Supplier']].merge(apr_seller, left_on='Supplier', right_on='seller', how='outer')

new_apr_sup[['total','item_count']]=new_apr_sup[['total','item_count']].fillna(0)

In [18]:
# new_apr_sup.to_excel('april_supp.xlsx')

## May

In [19]:
rebuy=rebuy[['User ID', 'Retailer Name']]
rebuy.head()

   User ID     Retailer Name
0   186104          sydney.s
1   182715             WGACA
2   205200      jonathanriss
3     2829         Chic Girl
4   188669  Bag Borrow Steal

In [20]:
may=buy_sell.loc[buy_sell['month']=='202105']

In [21]:
may_new=may.groupby(['buyer_id'])['total'].sum().reset_index()

In [22]:
may_new['buyer_id']=pd.to_numeric(may_new['buyer_id'])

In [23]:
may_new['total'].sum()

1761349.83

In [24]:
may_update=rebuy.merge(may_new, left_on='User ID', right_on='buyer_id', how='outer')

may_update.head()

    User ID     Retailer Name  buyer_id     total
0  186104.0          sydney.s       NaN       NaN
1  182715.0             WGACA  182715.0   69103.0
2  205200.0      jonathanriss       NaN       NaN
3    2829.0         Chic Girl    2829.0    2774.0
4  188669.0  Bag Borrow Steal  188669.0  124503.0

In [25]:
may_update['total']=may_update['total'].fillna(0)

# may_update.to_excel('may_gmv.xlsx')

In [26]:
may['total'].sum()

1761349.83

In [27]:
may_update['total'].sum()

1761349.8299999998

In [28]:
# new_list=list(may_update['buyer'][343:359])

In [29]:
# dict={}
# for n in new_list:
#     id=list(may[may['buyer']==n]['buyer_id'])
#     dict[n]=id
# dict

In [30]:
# bout=pd.read_csv('snobswapboutiques.csv')
# bout['Username']=bout['Username'].str.lower()

# bout_list=list(bout['Username'])

# new=may_update.drop(list(may_update.loc[may_update['buyer'].isin(bout_list)].index))

# new.shape

In [31]:
may_sell=may.groupby('seller_id')['total'].sum().reset_index()

may_items=may.groupby('seller_id')['item_id'].count().rename('item_count').sort_values(ascending=False).reset_index()

may_seller=may_sell.merge(may_items)

may_seller.head()

  seller_id     total  item_count
0    196448  540275.0        1067
1    198548  121387.0         340
2    199622   29810.0          76
3    199623   28632.0          42
4    199748   13217.0          13

In [37]:
new_may_sup=supply[['Seller ID', 'Supplier']].merge(may_seller, left_on='Seller ID', right_on='seller_id', how='outer')

new_may_sup[['total','item_count']]=new_may_sup[['total','item_count']].fillna(0)

new_may_sup.sort_values(by='total',ascending=False).head()

   Seller ID           Supplier seller_id     total  item_count
4     196448             aucnet    196448  540275.0      1067.0
8     204780                SOU    204780  198914.0       190.0
39    215997    camille+ecoring    215997  150290.0       297.0
3     198548    Next Innovation    198548  121387.0       340.0
34    215421  RS_JapanWholesale    215421   97396.0        59.0

In [38]:
new_may_sup['total'].sum()

1761349.83

In [39]:
# new_may_sup.to_excel('may_supp.xlsx')